<a href="https://colab.research.google.com/github/bryanoconnell01/Colab-for-Udemy/blob/main/Pandas_MultiIndexing_%26_Groupby_Skeleton.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1. IMPORT AND EXPLORE DATASET

In [2]:
import pandas as pd  # BOC
#   https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html?highlight=encoding    # useful source

In [6]:
# Import dataset using Pandas
# Link to Dataset: https://www.kaggle.com/carrie1/ecommerce-data
# Data contains transactions details between 01/12/2010 and 09/12/2011 for a UK-based non-store online retail.
# The company specializes in selling unique gifts
sales_df = pd.read_csv('ecommerce_sales.csv', encoding = 'unicode_escape')
sales_df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6.0,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6.0,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8.0,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6.0,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6.0,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
75101,542541,22124,SET OF 2 TEA TOWELS PING MICROWAVE,1.0,1/28/2011 14:25,2.46,NaN,United Kingdom
75102,542541,22131,FOOD CONTAINER SET 3 LOVE HEART,1.0,1/28/2011 14:25,4.13,NaN,United Kingdom
75103,542541,22135,MINI LADLE LOVE HEART PINK,1.0,1/28/2011 14:25,0.83,NaN,United Kingdom
75104,542541,22148,EASTER CRAFT 4 CHICKS,3.0,1/28/2011 14:25,4.13,NaN,United Kingdom
75105,542541,22149,FELTCRAFT 6 FLOWER FRIENDS,NaN,NaN,NaN,NaN,NaN

In [4]:
sales_df.info()   # boc line

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200594 entries, 0 to 200593
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    200594 non-null  object
 1   StockCode    200594 non-null  object
 2   Description  199802 non-null  object
 3   Quantity     200594 non-null  int64
 4   InvoiceDate  200594 non-null  object
 5   UnitPrice    200593 non-null  float64
 6   CustomerID   142574 non-null  float64
 7   Country      200593 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 12.2+ MB

In [6]:
# Let's view the types of data
# Note that InvoiceDate is in object format, we will need to convert it into Datetime format
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200594 entries, 0 to 200593
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    200594 non-null  object
 1   StockCode    200594 non-null  object
 2   Description  199802 non-null  object
 3   Quantity     200594 non-null  int64
 4   InvoiceDate  200594 non-null  object
 5   UnitPrice    200593 non-null  float64
 6   CustomerID   142574 non-null  float64
 7   Country      200593 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 12.2+ MB

In [7]:
sales_df.tail(10)   # loks like not all the lines were written

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
200584,554147,22037,ROBOT BIRTHDAY CARD,12,5/23/2011 10:48,0.42,12423.0,Belgium
200585,554147,22969,HOMEMADE JAM SCENTED CANDLES,12,5/23/2011 10:48,1.45,12423.0,Belgium
200586,554147,POST,POSTAGE,2,5/23/2011 10:48,15.00,12423.0,Belgium
200587,554147,21746,SMALL RED RETROSPOT WINDMILL,12,5/23/2011 10:48,1.25,12423.0,Belgium
200588,554147,23084,RABBIT NIGHT LIGHT,6,5/23/2011 10:48,2.08,12423.0,Belgium
200589,554147,21749,LARGE RED RETROSPOT WINDMILL,6,5/23/2011 10:48,2.10,12423.0,Belgium
200590,554147,23199,JUMBO BAG APPLES,10,5/23/2011 10:48,2.08,12423.0,Belgium
200591,554147,23256,CHILDRENS CUTLERY SPACEBOY,4,5/23/2011 10:48,4.15,12423.0,Belgium
200592,554147,23254,CHILDRENS CUTLERY DOLLY GIRL,4,5/23/2011 10:48,4.15,12423.0,Belgium
200593,554147,23204,CHARLOTTE BAG APPLES DESIGN,10,5/23/2011 10:4,NaN,NaN,NaN

In [ ]:
## Note some missing elements

In [2]:
import pandas as pd  # BOC

In [7]:
# Convert Invoice date to datetime format
sales_df['InvoiceDate'] = pd.to_datetime(sales_df['InvoiceDate'])

In [8]:
# Check datatype again to confirm!
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75106 entries, 0 to 75105
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    75106 non-null  object
 1   StockCode    75106 non-null  object
 2   Description  74903 non-null  object
 3   Quantity     75105 non-null  float64
 4   InvoiceDate  75105 non-null  datetime64[ns]
 5   UnitPrice    75105 non-null  float64
 6   CustomerID   46828 non-null  float64
 7   Country      75105 non-null  object
dtypes: datetime64[ns](1), float64(3), object(4)
memory usage: 4.6+ MB

In [10]:
# Check the number of Null values in the data
sales_df.isnull()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
75101,False,False,False,False,False,False,True,False
75102,False,False,False,False,False,False,True,False
75103,False,False,False,False,False,False,True,False
75104,False,False,False,False,False,False,True,False
75105,False,False,False,True,True,True,True,True

In [11]:
sales_df.isnull().sum()

InvoiceNo          0
StockCode          0
Description      203
Quantity           1
InvoiceDate        1
UnitPrice          1
CustomerID     28278
Country            1
dtype: int64

**MINI CHALLENGE #1:**
- **How many unique countries are present in the dataset? List all countries**

In [14]:
# Using unique()  below
# https://pandas.pydata.org/docs/reference/api/pandas.Series.unique.html?highlight=unique#pandas.Series.unique

sales_df['Country'].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Austria',
       'Israel', 'Finland', 'Bahrain', 'Greece', 'Hong Kong', 'Singapore',
       'Lebanon', nan], dtype=object)

In [15]:
## Alternative 
sales_df.nunique()

InvoiceNo      3339
StockCode      3019
Description    2948
Quantity        256
InvoiceDate    2990
UnitPrice       460
CustomerID     1340
Country          28
dtype: int64

# 2. GROUPBY

In [16]:
sales_df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6.0,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6.0,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8.0,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6.0,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6.0,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
75101,542541,22124,SET OF 2 TEA TOWELS PING MICROWAVE,1.0,2011-01-28 14:25:00,2.46,NaN,United Kingdom
75102,542541,22131,FOOD CONTAINER SET 3 LOVE HEART,1.0,2011-01-28 14:25:00,4.13,NaN,United Kingdom
75103,542541,22135,MINI LADLE LOVE HEART PINK,1.0,2011-01-28 14:25:00,0.83,NaN,United Kingdom
75104,542541,22148,EASTER CRAFT 4 CHICKS,3.0,2011-01-28 14:25:00,4.13,NaN,United Kingdom
75105,542541,22149,FELTCRAFT 6 FLOWER FRIENDS,NaN,NaT,NaN,NaN,NaN

In [17]:
# A groupby operation involves some combination of splitting the object, applying a function, and combining the results. 
# This can be used to group large amounts of data and compute operations on these groups.
# Link: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html
sales_df.groupby('Country')['UnitPrice'].mean()

Country
Australia          2.752394
Austria            7.235556
Bahrain            3.810000
Belgium            3.159367
Channel Islands    7.321702
Cyprus             4.956465
Denmark            4.648500
EIRE               4.776588
Finland            5.223214
France             3.548694
Germany            3.473134
Greece             6.480937
Hong Kong          3.137895
Iceland            2.712667
Israel             4.250000
Italy              3.743226
Japan              1.903623
Lebanon            5.387556
Lithuania          2.841143
Netherlands        1.993733
Norway             1.624694
Poland             3.485758
Portugal           3.816694
Singapore          4.702500
Spain              9.849696
Sweden             3.171613
Switzerland        2.651714
United Kingdom     5.757416
Name: UnitPrice, dtype: float64

In [18]:
sales_df.groupby('Country')['UnitPrice'].min()

Country
Australia          0.36
Austria            0.42
Bahrain            3.81
Belgium            0.12
Channel Islands    0.42
Cyprus             0.42
Denmark            0.42
EIRE               0.00
Finland            0.29
France             0.19
Germany            0.00
Greece             1.25
Hong Kong          0.21
Iceland            0.42
Israel             1.25
Italy              0.42
Japan              0.36
Lebanon            0.55
Lithuania          1.25
Netherlands        0.21
Norway             0.29
Poland             0.42
Portugal           0.21
Singapore          0.21
Spain              0.19
Sweden             0.19
Switzerland        0.18
United Kingdom     0.00
Name: UnitPrice, dtype: float64

In [19]:
sales_df.groupby('Country')['UnitPrice'].max()

Country
Australia             12.75
Austria               40.00
Bahrain                3.81
Belgium               18.00
Channel Islands       50.00
Cyprus               125.00
Denmark               18.00
EIRE                  65.00
Finland               40.00
France               150.00
Germany               34.95
Greece                14.95
Hong Kong             12.75
Iceland               12.75
Israel                 7.65
Italy                 35.00
Japan                  5.95
Lebanon               14.95
Lithuania              5.95
Netherlands           15.00
Norway                 8.50
Poland                12.75
Portugal              28.00
Singapore            125.00
Spain               1715.85
Sweden                40.00
Switzerland           40.00
United Kingdom     16888.02
Name: UnitPrice, dtype: float64

In [20]:
sales_df.groupby('InvoiceDate')['UnitPrice'].mean()

InvoiceDate
2010-12-01 08:26:00    3.910000
2010-12-01 08:28:00    1.850000
2010-12-01 08:34:00    4.833750
2010-12-01 08:35:00    5.950000
2010-12-01 08:45:00    2.764500
                         ...
2011-01-28 13:37:00    5.607097
2011-01-28 13:54:00    2.057353
2011-01-28 14:07:00    6.100000
2011-01-28 14:20:00    5.330000
2011-01-28 14:25:00    6.352828
Name: UnitPrice, Length: 2990, dtype: float64

In [21]:
sales_df.groupby(['Country', 'InvoiceDate'])['UnitPrice'].mean()

Country         InvoiceDate
Australia       2010-12-01 10:03:00    5.278571
                2010-12-08 09:53:00    2.726250
                2010-12-14 11:12:00    4.283333
                2010-12-17 14:10:00    3.510000
                2011-01-06 11:12:00    1.871304
                                         ...
United Kingdom  2011-01-28 13:37:00    5.320972
                2011-01-28 13:54:00    1.831304
                2011-01-28 14:07:00    6.100000
                2011-01-28 14:20:00    5.330000
                2011-01-28 14:25:00    6.352828
Name: UnitPrice, Length: 3033, dtype: float64

**MINI CHALLENGE #2:**
- **What is the average, maximum and minimum prices on 2010-12-01 08:34:00**

In [45]:
sales_df.groupby('InvoiceDate')['UnitPrice'].min()
#new = [x for x in out.__iter__()]
#new

#new = (x for x in out)
#new

InvoiceDate
2010-12-01 08:26:00    2.55
2010-12-01 08:28:00    1.85
2010-12-01 08:34:00    1.65
2010-12-01 08:35:00    5.95
2010-12-01 08:45:00    0.42
                       ...
2011-01-28 13:37:00    0.85
2011-01-28 13:54:00    0.42
2011-01-28 14:07:00    1.25
2011-01-28 14:20:00    3.29
2011-01-28 14:25:00    0.42
Name: UnitPrice, Length: 2990, dtype: float64

In [46]:
sales_df.groupby('InvoiceDate')['UnitPrice'].max()

InvoiceDate
2010-12-01 08:26:00      7.65
2010-12-01 08:28:00      1.85
2010-12-01 08:34:00      9.95
2010-12-01 08:35:00      5.95
2010-12-01 08:45:00     18.00
                        ...
2011-01-28 13:37:00     24.96
2011-01-28 13:54:00      5.95
2011-01-28 14:07:00     10.95
2011-01-28 14:20:00      8.29
2011-01-28 14:25:00    223.89
Name: UnitPrice, Length: 2990, dtype: float64

In [47]:
sales_df.groupby('InvoiceDate')['UnitPrice'].mean()

InvoiceDate
2010-12-01 08:26:00    3.910000
2010-12-01 08:28:00    1.850000
2010-12-01 08:34:00    4.833750
2010-12-01 08:35:00    5.950000
2010-12-01 08:45:00    2.764500
                         ...
2011-01-28 13:37:00    5.607097
2011-01-28 13:54:00    2.057353
2011-01-28 14:07:00    6.100000
2011-01-28 14:20:00    5.330000
2011-01-28 14:25:00    6.352828
Name: UnitPrice, Length: 2990, dtype: float64

In [49]:
sales_df.groupby('InvoiceDate')['UnitPrice'].mean()

InvoiceDate
2010-12-01 08:26:00    3.910000
2010-12-01 08:28:00    1.850000
2010-12-01 08:34:00    4.833750
2010-12-01 08:35:00    5.950000
2010-12-01 08:45:00    2.764500
                         ...
2011-01-28 13:37:00    5.607097
2011-01-28 13:54:00    2.057353
2011-01-28 14:07:00    6.100000
2011-01-28 14:20:00    5.330000
2011-01-28 14:25:00    6.352828
Name: UnitPrice, Length: 2990, dtype: float64

In [57]:
out = sales_df.groupby('InvoiceDate')['UnitPrice'].sum()
out
# https://realpython.com/pandas-groupby/

InvoiceDate
2010-12-01 08:26:00     27.37
2010-12-01 08:28:00      3.70
2010-12-01 08:34:00     77.34
2010-12-01 08:35:00      5.95
2010-12-01 08:45:00     55.29
                        ...
2011-01-28 13:37:00    521.46
2011-01-28 13:54:00     69.95
2011-01-28 14:07:00     12.20
2011-01-28 14:20:00     15.99
2011-01-28 14:25:00    628.93
Name: UnitPrice, Length: 2990, dtype: float64

# 3. CREATE MULTI-INDEX DATAFRAME

In [ ]:
# You can select any column to be the index for the DataFrame
# Use one column only as follows:

In [ ]:
# Let's see how many unique countries are present in the dataframe

In [ ]:
# Alternatively, We can have multiple keys (indexes) using Pandas Multi-indexing
# Take the columns with the least number of unique values and use it for the outermost index

# Let's import the dataset again using Pandas

In [ ]:
# Sort countries to start with alphabetical order

In [ ]:
# Now you need more than one index to access any element

In [ ]:
# Multiindex objects

In [ ]:
# It gives out the datetime and the country as well

**MINI CHALLENGE #3:**
- **Sort the DataFrame in a descending order (countries and dates)**

# 4. MULTI-INDEXING OPERATIONS - PART #1

In [ ]:
# You can change the names of the DataFrame by invoking the set_names method

**MINI CHALLENGE #4:**
- **Use InvoiceDate and Country in order as the multi-index**
- **Change the name of both indexes to "Date" and "location"**

# 5. MULTI-INDEXING OPERATIONS - PART #2

In [ ]:

# Sort countries to start with alphabetical order

In [ ]:
# you can use a multi-index reference to access specific elements 
# Alternatively, you can use a column name instead

In [ ]:
# feed index as a tuple (important to avoid confusion)
# first argument references rows and the second argument references a column

In [ ]:
# no issues with numeric indexing, you can use one index so no tuples are required

In [ ]:
# no issues with numeric indexing

In [ ]:
# You can use transpose to Transpose indexes and columns
# reflect the DataFrame over its main diagonal by writing rows as columns and vice-versa.

In [ ]:
# Let's import the dataset again using Pandas

In [ ]:
# You can perform swaplevel as follows:

In [ ]:
# Perform swaplevel again:

In [ ]:
# Please note that there is no point of adding [False, False] or [True, True]

In [ ]:
# only sort by that given level and ignore the others

**MINI CHALLENGE #5:**
- **Calculate the average unit price for transactions occured in "United Kingdom" at "12/1/2010 8:26"**

# MINI CHALLENGE SOLUTIONS

**MINI CHALLENGE #1 SOLUTION:**
- **How many unique countries are present in the dataset? List all countries**

In [ ]:
sales_df['Country'].unique()

In [ ]:
# Obtain the number of unique values in each column
sales_df.nunique()

**MINI CHALLENGE #2 SOLUTION:**
- **What is the average, maximum and minimum prices on 2010-12-01 08:34:00**

In [ ]:
# Min = 0.72 and Max = 1.85
sales_df.groupby('InvoiceDate')['UnitPrice'].min()

In [ ]:
sales_df.groupby('InvoiceDate')['UnitPrice'].max()

**MINI CHALLENGE #3 SOLUTION:**
- **Sort the DataFrame in a descending order (countries and dates)**

In [ ]:
# Please note that there is no point of adding [False, False] or [True, True]
sales_df.sort_index(ascending = False, inplace = True)
sales_df

**MINI CHALLENGE #4 SOLUTION:**
- **Use InvoiceDate and Country in order as the multi-index**
- **Change the name of both indexes to "Date" and "location"**

In [ ]:
sales_df = pd.read_csv('ecommerce_sales.csv', encoding = 'unicode_escape')
sales_df.set_index(keys = ["InvoiceDate", "Country"], inplace = True)
sales_df

In [ ]:
# You can change the names of the DataFrame by invoking the set_names method
sales_df.index.set_names(names = ['Date', 'Location'], inplace = True)
sales_df

**MINI CHALLENGE #5 SOLUTION:**
- **Calculate the average unit price for transactions occured in "United Kingdom" at "12/1/2010 8:26"**

In [ ]:
# Let's import the dataset again using Pandas
sales_df = pd.read_csv('ecommerce_sales.csv', encoding = 'unicode_escape')
sales_df.set_index(keys = ["Country", "InvoiceDate"], inplace = True)


print(sales_df.loc[("United Kingdom", "12/1/2010 8:26"), "UnitPrice"])

# feed index as a tuple (important to avoid confusion)
# first argument references rows and the second argument references a column
sales_df.loc[("United Kingdom", "12/1/2010 8:26"), "UnitPrice"].mean()